
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МодульОбъекта = РеквизитФормыВЗначение("Объект");
	
	ЭтотОбъект.Контекст = Новый Структура;
	ЭтотОбъект.Контекст.Вставить("ИспользуемоеИмяФайла", МодульОбъекта.ИспользуемоеИмяФайла);
	ЭтотОбъект.Контекст.Вставить("ИмяОбработки", СтрРазделить(ЭтотОбъект.ИмяФормы, ".")[1]);
	ЭтотОбъект.Контекст.Вставить("ИменаФорм", Новый Массив);
	Для Каждого МетаФорма Из МодульОбъекта.Метаданные().Формы Цикл
		ЭтотОбъект.Контекст.ИменаФорм.Добавить(МетаФорма.Имя);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ПослеОткрытияАсинх", 5, Истина);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПослеОткрытияАсинх()
	
	ГлавнаяФорма = ПолучитьФорму(ИмяДругойФормы("Форма"));
	
	СписокМодулей = Новый Структура;
	Для Каждого ИмяФормыОбработки Из ЭтотОбъект.Контекст.ИменаФорм Цикл
		
		Если СтрНачинаетсяС(ИмяФормыОбработки, "Модуль") Тогда
			СписокМодулей.Вставить(ИмяФормыОбработки, ПолучитьФорму(ИмяДругойФормы(ИмяФормыОбработки), , ГлавнаяФорма));
		КонецЕсли;
	КонецЦикла;

	Закрыть();
	
	ГлавнаяФорма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Функция ИмяДругойФормы(Знач Имя)
	Возврат СтрШаблон("ВнешняяОбработка.%1.Форма.%2", ЭтотОбъект.Контекст.ИмяОбработки, Имя);
КонецФункции
