
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	МодульОбъекта = РеквизитФормыВЗначение("Объект");

	ЭтотОбъект.ДанныеНаСервере = Новый Структура;
	ЭтотОбъект.ДанныеНаСервере.Вставить("Версия", МодульОбъекта.Метаданные().Комментарий);
	ЭтотОбъект.ДанныеНаСервере.Вставить("ИспользуемоеИмяФайла", МодульОбъекта.ИспользуемоеИмяФайла);
	ЭтотОбъект.ДанныеНаСервере.Вставить("ИмяОбработки", СтрРазделить(ЭтотОбъект.ИмяФормы, ".")[1]);
	ЭтотОбъект.ДанныеНаСервере.Вставить("ФормыОбработки", Новый Массив);
	Для Каждого МетаФорма Из МодульОбъекта.Метаданные().Формы Цикл
		ЭтотОбъект.ДанныеНаСервере.ФормыОбработки.Добавить(МетаФорма.Имя);
	КонецЦикла;
	ЭтотОбъект.ДанныеНаСервере.Вставить("АдресХранилищаОбработки", 
		ПоместитьВоВременноеХранилище(Новый Структура, ЭтотОбъект.УникальныйИдентификатор));

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ПослеОткрытияАсинх", 5, Истина);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПослеОткрытияАсинх()

	// Контекст — DI-контейнер со вложенными структурами.
	
	Контекст = Новый Структура;
	Контекст.Вставить("ИмяОбработки", ЭтотОбъект.ДанныеНаСервере.ИмяОбработки);
	Контекст.Вставить("ИспользуемоеИмяФайла", ЭтотОбъект.ДанныеНаСервере.ИспользуемоеИмяФайла);

	// Создание главной формы, она будет владельцем всех форм-модулей.
	
	ГлавнаяФорма = ПолучитьФорму(ИмяДругойФормы("ГлавнаяФорма"));
	Контекст.Вставить("ГлавнаяФорма", Новый Структура(
		"Форма", ГлавнаяФорма));

	// Создание всех форм-модулей - формы с префиксом "Модуль".

	Для Каждого ФормаОбработки Из ЭтотОбъект.ДанныеНаСервере.ФормыОбработки Цикл
		
		Если НЕ СтрНачинаетсяС(ФормаОбработки, "Модуль") Тогда
			Продолжить;
		КонецЕсли;

		Контекст.Вставить(ФормаОбработки, Новый Структура(
			"Форма", ПолучитьФорму(ИмяДругойФормы(ФормаОбработки), , ГлавнаяФорма)));
		
	КонецЦикла;

	// Инициализация: ГлавнаяФорма заполнит свою секцию и инициализирует модули

	ГлавнаяФорма.Инициализация(Контекст);

	Закрыть();

	ГлавнаяФорма.Открыть();

КонецПроцедуры

&НаКлиенте
Функция ИмяДругойФормы(Знач Имя)
	Возврат СтрШаблон("ВнешняяОбработка.%1.Форма.%2", ЭтотОбъект.ДанныеНаСервере.ИмяОбработки, Имя);
КонецФункции
